In [2]:
import numpy as np
import pandas as pd

In [13]:
stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                         index = ['Closing price','EPS','Shares Outstanding(M)',
                                 'Beta', 'P/E','Market Cap(B)']),
      'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                        index = ['Closing price','EPS','Shares Outstanding(M)',
                                 'Beta','P/E','Market Cap(B)']),
        'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                           index = ['Closing price','EPS','Shares Outstanding(M)',
                                      'P/E', 'Market Cap(B)']),
             'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36],
                                index=['Closing price','EPS','Shares Outstanding(M)',
                                     'P/E','Beta', 'Market Cap(B)']),
             'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                                index=['Closing price','EPS','Shares Outstanding(M)',
                                      'Market Cap(B)']),
             'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                                index=['Closing price','EPS','Shares Outstanding(M)','P/E',
                                      'Market Cap(B)','Beta'])}

In [15]:
type(stock)

dict

In [16]:
tabela = pd.DataFrame(stock)

In [17]:
tabela.head(5)

                 AMZN     GOOG      FB   YHOO   TWTR    AAPL
Beta             0.52     0.87     NaN   0.66    NaN    0.84
Closing price  346.15  1133.43   61.48  34.90  65.25  501.53
EPS              0.59    36.05    0.59   1.27  -0.30   40.32
Market Cap(B)  158.88   380.64  150.92  35.36  36.23  447.59
P/E            589.80    31.44  104.93  27.48    NaN   12.44

In [19]:
tabela2 = pd.DataFrame(stock, index = ['Beta','EPS'], columns = ['AMZN','GOOG'])

In [20]:
tabela2

      AMZN   GOOG
Beta  0.52   0.87
EPS   0.59  36.05

In [1]:
Quadro_Medalhas_Olimpiada = {
        'USA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
        'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
        'Britain':{'Ouro':27, 'Prata':23, 'Bronze':17},
        'Russe':{'Ouro':19, 'Prata':18, 'Bronze':19},\
        'Germany':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [3]:
olimpiada = pd.DataFrame.from_dict(Quadro_Medalhas_Olimpiada)

In [4]:
type(olimpiada)

pandas.core.frame.DataFrame

In [5]:
olimpiada

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [6]:
medalhas_china = olimpiada['China']

In [7]:
medalhas_china

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [8]:
olimpiada.USA

Ouro      46
Prata     37
Bronze    38
Name: USA, dtype: int64

In [9]:
olimpiada[['Germany','Britain']]

        Germany  Britain
Ouro         17       27
Prata        10       23
Bronze       15       17

In [10]:
olimpiada.get('USA')

Ouro      46
Prata     37
Bronze    38
Name: USA, dtype: int64

In [12]:
olimpiada.iloc[1:,:2]

        USA  China
Prata    37     18
Bronze   38     26

In [13]:
olimpiada[::-1]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15
Prata    37     18       23     18       10
Ouro     46     26       27     19       17

In [18]:
lista = olimpiada.loc['Ouro']

In [22]:
lista2= lista.to_list()

In [23]:
lista2

[46, 26, 27, 19, 17]

In [29]:
olimpiada.loc[:,'Germany']

Ouro      17
Prata     10
Bronze    15
Name: Germany, dtype: int64

In [30]:
olimpiada.loc['Ouro']>20

USA         True
China       True
Britain     True
Russe      False
Germany    False
Name: Ouro, dtype: bool

In [32]:
olimpiada.loc[:,olimpiada.loc['Ouro']>20]

        USA  China  Britain
Ouro     46     26       27
Prata    37     18       23
Bronze   38     26       17

In [33]:
del olimpiada['USA']

In [34]:
olimpiada

        China  Britain  Russe  Germany
Ouro       26       27     19       17
Prata      18       23     18       10
Bronze     26       17     19       15

In [35]:
olimpiada.insert(0,'Brasil',(10,20,30))

In [36]:
olimpiada

        Brasil  China  Britain  Russe  Germany
Ouro        10     26       27     19       17
Prata       20     18       23     18       10
Bronze      30     26       17     19       15

In [37]:
olimpiada.describe()

       Brasil      China    Britain      Russe    Germany
count     3.0   3.000000   3.000000   3.000000   3.000000
mean     20.0  23.333333  22.333333  18.666667  14.000000
std      10.0   4.618802   5.033223   0.577350   3.605551
min      10.0  18.000000  17.000000  18.000000  10.000000
25%      15.0  22.000000  20.000000  18.500000  12.500000
50%      20.0  26.000000  23.000000  19.000000  15.000000
75%      25.0  26.000000  25.000000  19.000000  16.000000
max      30.0  26.000000  27.000000  19.000000  17.000000